using System.Collections.Generic;

namespace TelegramBot.Localization.UkraineLokalization.DescriptionLocalization
{
    static class DescriptionOnUkrainian
    {
        /// <summary>
        /// Переведенные переменные из сайта https://openweathermap.org/weather-conditions
        /// </summary>
        public static List<string> UkrDescription = new List<string>()
        {
            "гроза з невеликим дощем ⚡☔🌨️",
            "гроза з дощем ⚡🌧️",
            "гроза з сильним дощем ⛈️☔⚡",
            "легка гроза 🌩️",
            "гроза ⚡🌩️",
            "сильна гроза ⚡⚡",
            "рвана гроза 🌩️🌥️🌩️",
            "гроза з дрібним дощем ☔🌨️🌩️",
            "гроза з дощем ⛈️⚡",
            "гроза з сильним дощем ⛈️⛈️⚡",

            "мало опадів 🌦️",
            "дощ ☔🌧",
            "сильний дощ ⚡☔⛈️",
            "невеликий дрібний дощ ☁️🌨️",
            "дощ ☔🌧",
            "сильний дощ ☔⛈️",
            "дощ ☔🌧️",
            "дощ ☔🌧️",
            "дощ ☔🌧️",

            "невеликий дощ 🌨🌦️️",
            "помірний дощ ☔🌧🌦️️",
            "сильний дощ ⚡☔⛈️",
            "дуже сильний дощ 🌧️⛈️",
            "екстремальний дощ ⛈️⛈️⚡",
            "холодний дощ 🌧️☔",
            "невеликий дощ ☔🌦️",
            "дощ 🌧️",
            "сильний зливовий дощ ⛈️🌨⚡",
            "рваний дощ 🌧☁️🌨️",

            "дрібний сніг ❄️",
            "Сніг ❄️",
            "Сильний сніг ❄️💦",
            "мокрий сніг(Дощ) ❄️💦☔",
            "мокрий сніг ❄️💦",
            "Сніг ❄️",
            "Невеликий дощ зі снігом ❄️🌨",
            "Дощ і сніг ❄️🌨☔",
            "Невеликий дощ сніг ❄️🌨️",
            "Снігопад ❄️☁️",
            "Сильний снігопад ❄️❄️☁️",

            "туман 🌫️",
            "туман 🌫️",
            "туман 🌫️",
            "вихори піску/пилу 🌬️🏜️",
            "туман 🌫️",
            "вихори піску/пилу 🌬️🏜️",
            "вихори піску/пилу 🌬️🏜️",
            "вулканічний попіл в атмосфері 🌬️",
            "шквали 🌬️🌀",
            "торнадо 🌪️",
            "чисте небо ☀️",
            "мало хмар 🌤️",
            "невелика хмарність ⛅",
            "помірна хмарність ⛅",
            "Хмарно ☁️☁️",

            "Дощ зі снігом ❄️🌨☔",
            "Сніг ❄️"
        };
    }
}
